using System.Text;

class RandomNumberGenerator
{
    private static int i;

    static void Main()
    {
        Console.OutputEncoding = Encoding.UTF8;
        Console.InputEncoding = Encoding.Unicode;
        
        Console.WriteLine("Добро пожаловать в игру 'Угадай число'!");
        Console.WriteLine("Я загадал число между: 1 и 100.");
        Console.WriteLine("Попробуйте угадать.");
       
        int guess = 0;
        Random random = new Random();
        var secret = random.Next(1, 100);
        i = 1;
        do
        {
            while (true)
            {
                Console.WriteLine("Введите число: ");
                string text = Console.ReadLine();
                if (int.TryParse(text, out guess))
                {
                    break;
                }
                else
                {
                    Console.WriteLine("Не удалось распознать число, попробуйте еще раз.");
                }
            }
                i++;
                if (guess == secret)
                {
                Console.WriteLine("Верно, Вы угадали загаданное число за " + i + " попыток");
                
                break;
                }
                else if (guess < secret)
                {
                Console.WriteLine("Загаданное число больше");
                }
                else if (guess > secret)
                {
                Console.WriteLine("Загаданное число меньше");
                }
                if (i > 10)
                {
                Console.WriteLine("Вы проиграли");
                Console.WriteLine("Загаданное число:" + secret);
             }
        }
        while (i <= 10);
        // Создаем объект для генерации чисел

        // Создаем переменную для хранения случайного числа

        // Создаем переменную для хранения числа попыток

        // 1. Создаем цикл, который будет выполняться до тех пор, пока не будет угадано число


        // 2. В теле цикла:
        // 2.1. Увеличиваем счетчик попыток на 1

        // 2.2. Считываем число с клавиатуры и сохраняем в переменную

        // 2.3. Сравниваем загаданное число с введенным пользователем

        // 2.4. Если числа равны, то выводим сообщение о победе и о количестве попыток

        // 2.5. Если число пользователя больше загаданного, то выводим сообщение, что число больше загаданного

        // 2.6. Если число пользователя меньше загаданного, то выводим сообщение, что число меньше загаданного

        // 2.7. Если число попыток равно 10, то выводим сообщение о проигрыше и загаданное число


        // Так же помним что надо проверять ввод пользователя на корректность
        // Если пользователь ввел не число, то выводим сообщение об ошибке и просим ввести число еще раз
        // Число джолжно быть в диапазоне от 1 до 100 и целое

    }
}
